"""Игровые правила.

В зависимости от выбранных правил изменяться поведение игры.
"""

from dataclasses import dataclass
from enum import IntEnum


class GameRules(IntEnum):
    """Набор игровых правил."""

    twist_hand = 1 << 0  # "🤝 Обмен картами
    rotate_cards = 1 << 1  # "🌀 Круговой обмен
    one_winner = 1 << 2  # "👑 Один победитель
    auto_skip = 1 << 3  # "💸 Авто пропуск
    take_until_cover = 1 << 4  # "🍷 Беру до последнего
    shotgun = 1 << 5  # "🔫 Револьвер
    deferred_take = 1 << 6  # "⏳ Отложенное взятие
    auto_choose_color = 1 << 7  # "🌷 самоцвет
    random_color = 1 << 8  # "🎲 Какой цвет
    side_effect = 1 << 9  # "💎 Побочный выброс
    twist_hand_pass = 1 << 10  # "👋 Без обмена
    intervention = 1 << 11  # "😈 Вмешательство 🔧
    special_wild = 1 << 12  # "❤️ Особая дикость


Rule = GameRules | int


@dataclass(slots=True)
class RuleSet:
    """Набор выбранных игровых правил."""

    state: int = 0

    def status(self, rule: Rule) -> bool:
        """Проверяет, включено ли выбранное правило."""
        return (self.state & rule) != 0

    def toggle(self, rule: Rule) -> None:
        """Переключает состояние битового флага."""
        self.state ^= rule
